MA1/Cloud_Computing/project/manager_scripts/scalability/artillery/login-user-load-test.yml
config:
  # Replace (if needed) IP address of VM [node]
  target: http://scapp_users-service
  phases:
    - duration: 60
      arrivalRate: 1000
  headers:
          Content-Type: application/json

scenarios:
  - flow:
    - post:
        url: /login             # Replace with the correct login endpoint
        json:
            username: "{ admin }"
            password: "{ admin }"